### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import os

# File to Load (Remember to Change These)
purchasedata = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchasedata_df = pd.read_csv(purchasedata)
purchasedata_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [69]:
#total number of players
total_players=purchasedata_df['SN'].nunique()
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
#number of unique items
purchasedata_df['Item Name'].nunique()

179

In [4]:
#average price of items
average = purchasedata_df["Price"].mean()
average

3.050987179487176

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed


## Purchasing Analysis (Gender)

In [74]:
#Percentage and count of players of each gender. 
#Count then make another column to display percentage

#percentage=purchasedata_df["Gender"].value_counts()
#percentage

gender = purchasedata_df.groupby("Gender")
gender_count = gender.nunique()["SN"]

percent=(gender_count/total_players)*100

gender_list=pd.DataFrame({"Total Count": gender_count, "Percentage of Players":percent})
gender_list.sort_values(["Total Count"], ascending = False).style.format({"Percentage of Players":"{:.2f}%"})

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender

* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [104]:
# Filter the data so that only those males in the Gender column are in a DataFrame
male_df = purchasedata_df.loc[purchasedata_df["Gender"] == "Male", :]
male_df.head()
male_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [105]:
# Filter the data so that only those FEMALES in the Gender column are in a DataFrame
female_df = purchasedata_df.loc[purchasedata_df["Gender"] == "Female", :]
female_df.head()
female_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
...,...,...,...,...,...,...,...
731,731,Eudanu84,22,Female,12,Dawne,1.02
740,740,Reunasu60,22,Female,127,"Heartseeker, Reaver of Souls",3.92
754,754,Pheosurllorin41,23,Female,79,"Alpha, Oath of Zeal",4.05
767,767,Ilmol66,8,Female,92,Final Critic,4.88
775,775,Aethedru70,21,Female,60,Wolf,3.54

In [107]:
# Filter the data so that only those OTHERS in the Gender column are in a DataFrame
other_df = purchasedata_df.loc[purchasedata_df["Gender"] == "Other / Non-Disclosed", :]
other_df.head()
other_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39
237,237,Idairin51,20,Other / Non-Disclosed,16,Restored Bauble,3.55
242,242,Eodaisu60,16,Other / Non-Disclosed,39,"Betrayal, Whisper of Grieving Widows",3.94
291,291,Idairin51,20,Other / Non-Disclosed,35,Heartless Bone Dualblade,3.45
350,350,Rairith81,15,Other / Non-Disclosed,34,Retribution Axe,2.22
401,401,Lirtim36,15,Other / Non-Disclosed,46,Hopeless Ebon Dualblade,1.33
484,484,Chanosian48,35,Other / Non-Disclosed,39,"Betrayal, Whisper of Grieving Widows",3.94
549,549,Maluncil97,25,Other / Non-Disclosed,146,Warped Iron Scimitar,3.10
629,629,Maluncil97,25,Other / Non-Disclosed,107,"Splitter, Foe Of Subtlety",2.18
637,637,Airi27,24,Other / Non-Disclosed,163,Thunderfury Scimitar,3.45
747,747,Siarithria38,38,Other / Non-Disclosed,146,Warped Iron Scimitar,3.10

In [68]:
# Total Purchase Count of all Males; All Purchase ID, total the column.

purchase_count = len(male_df["Purchase ID"].unique())
print(purchase_count)

652

In [108]:
# Total Purchase Count of all FEMALES; All Purchase ID, total the column.

purchase_count = len(female_df["Purchase ID"].unique())
print(purchase_count)

113

In [109]:
# Total Purchase Count of all OTHERS; All Purchase ID, total the column.

purchase_count = len(other_df["Purchase ID"].unique())
print(purchase_count)

15

In [53]:
#By male:  avg. purchase price
male_average = male_df["Price"].mean()
male_average
print(male_average)

3.0178527607361953

In [110]:
#By FEMALE:  avg. purchase price
female_average = female_df["Price"].mean()
female_average
print(male_average)

3.0178527607361953

In [82]:
#clean table
clean_male_df = male_df.dropna(how="any")
clean_male_df.count()

Purchase ID    652
SN             652
Age            652
Gender         652
Item ID        652
Item Name      652
Price          652
dtype: int64

In [111]:
#By OTHERS:  avg. purchase price
other_average = other_df["Price"].mean()
other_average
print(other_average)

3.3460000000000005

In [93]:
#By male: unique User ID
male_user_id_df = clean_male_df["SN"].value_counts()

#Purchase Count by person
male_purchase_count_df = clean_male_df["Item ID"].value_counts()

item_list=pd.DataFrame({"User Name": male_user_id_df, "Total Count": male_purchase_count_df})
item_list

            User Name  Total Count
0                 NaN          4.0
1                 NaN          3.0
2                 NaN          5.0
3                 NaN          5.0
4                 NaN          5.0
...               ...          ...
Yasur85           1.0          NaN
Yathecal72        1.0          NaN
Yathedeu43        2.0          NaN
Zhisrisu83        2.0          NaN
Zontibe81         3.0          NaN

[662 rows x 2 columns]

In [112]:
#By female: unique User ID
female_user_id_df = female_df["SN"].value_counts()

#Purchase Count by person
female_purchase_count_df = female_df["Item ID"].value_counts()

female_item_list=pd.DataFrame({"User Name": female_user_id_df, "Total Count": female_purchase_count_df})
female_item_list

               User Name  Total Count
1                    NaN          1.0
2                    NaN          1.0
3                    NaN          1.0
6                    NaN          1.0
7                    NaN          3.0
...                  ...          ...
Wailin72             1.0          NaN
Yana46               1.0          NaN
Yarithrin84          1.0          NaN
Yathecal82           3.0          NaN
Yoishirrala98        1.0          NaN

[171 rows x 2 columns]

In [113]:
#By Others: unique User ID
other_user_id_df = other_df["SN"].value_counts()

#Purchase Count by person
other_purchase_count_df = other_df["Item ID"].value_counts()

other_item_list=pd.DataFrame({"User Name": other_user_id_df, "Total Count": other_purchase_count_df})
other_item_list

              User Name  Total Count
16                  NaN          1.0
24                  NaN          1.0
34                  NaN          1.0
35                  NaN          1.0
39                  NaN          2.0
41                  NaN          1.0
46                  NaN          1.0
80                  NaN          1.0
107                 NaN          1.0
136                 NaN          1.0
146                 NaN          2.0
160                 NaN          1.0
163                 NaN          1.0
Airi27              1.0          NaN
Chanosian48         2.0          NaN
Eodaisu60           1.0          NaN
Haerithp41          1.0          NaN
Idairin51           2.0          NaN
Jiskirran77         1.0          NaN
Lirtim36            1.0          NaN
Maluncil97          2.0          NaN
Rairith81           1.0          NaN
Siarithria38        2.0          NaN
Sundim98            1.0          NaN

In [115]:
grouped_male_df = male_df.groupby(['SN'])
print(grouped_male_df)
grouped_male_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001960F430490>

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1
Aelastirin39            2    2       2        2          2      2
Aelidru27               1    1       1        1          1      1
Aelin32                 3    3       3        3          3      3
Aelly27                 2    2       2        2          2      2
Aellynun67              1    1       1        1          1      1
Aellyria80              1    1       1        1          1      1

In [116]:
grouped_female_df = female_df.groupby(['SN'])
print(grouped_female_df)
grouped_female_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001960E28CA60>

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adastirin33              1    1       1        1          1      1
Aerithllora36            2    2       2        2          2      2
Aethedru70               1    1       1        1          1      1
Aidain51                 1    1       1        1          1      1
Aiduesu86                1    1       1        1          1      1
Aillyrin83               1    1       1        1          1      1
Aisurdru79               2    2       2        2          2      2
Assilsan72               1    1       1        1          1      1
Assosia88                1    1       1        1          1      1
Baelollodeu94            2    2       2        2          2      2

## Age Demographics

In [117]:
grouped_other_df = other_df.groupby(['SN'])
print(grouped_other_df)
grouped_other_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001960F438C40>

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Airi27                  1    1       1        1          1      1
Chanosian48             2    2       2        2          2      2
Eodaisu60               1    1       1        1          1      1
Haerithp41              1    1       1        1          1      1
Idairin51               2    2       2        2          2      2
Jiskirran77             1    1       1        1          1      1
Lirtim36                1    1       1        1          1      1
Maluncil97              2    2       2        2          2      2
Rairith81               1    1       1        1          1      1
Siarithria38            2    2       2        2          2      2

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [95]:
# Establish bins for ages

# Figure out the minimum and maximum ages of players
print(male_df["Age"].max())
print(male_df["Age"].min())

45
7

In [98]:
# Create bins in which to place values based upon age of players
bins = [0, 10, 20, 30, 40, 50]

# Create labels for these bins
group_labels = ["0 to 9", "10 to 19", "20 to 29", "30 to 39", "40 to 50"]

In [99]:
# Slice the data and place it into bins
pd.cut(male_df["Age"], bins, labels=group_labels).head()

0    10 to 19
1    30 to 39
2    20 to 29
3    20 to 29
4    20 to 29
Name: Age, dtype: category
Categories (5, object): [0 to 9 < 10 to 19 < 20 to 29 < 30 to 39 < 40 to 50]

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame